Python 3.12.0 (tags/v3.12.0:0fb18b0, Oct  2 2023, 13:03:39) [MSC v.1935 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> def land(width,long,price=999888):
...     cal = width*long
...     cal_wa = cal/4
...     print('ที่ดินผืนนี้กว้าง: {} เมตร ยาว: {} เมตร'.format(width,long))
...     print('ที่ดินผืนนี้มีพื้นที่: {} ตารางเมตร'.format(cal))
...     print('ที่ดินผืนนี้มีพื้นที่: {} ตารางวา'.format(cal_wa))
...     calprice = cal_wa*price
...     return 'ที่ดินผืนนี้ราคา: {:,.2f} บาท'.format(calprice)
... 
>>> res=land(5,15)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา
>>> print(res)
ที่ดินผืนนี้ราคา: 18,747,900.00 บาท
>>> res=land(5,15,1000000)
ที่ดินผืนนี้กว้าง: 5 เมตร ยาว: 15 เมตร
ที่ดินผืนนี้มีพื้นที่: 75 ตารางเมตร
ที่ดินผืนนี้มีพื้นที่: 18.75 ตารางวา
>>> print(res)
ที่ดินผืนนี้ราคา: 18,750,000.00 บาท
